app/controllers/api/v1/notes_controller.rb

SELECT "notes".* FROM "notes"
---
  def index
    notes = Note.all

INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "blahb"], ["body", "blah"], ["created_at", "2018-03-22 17:30:59.967090"], ["updated_at", "2018-03-22 17:30:59.967090"]]
---
  def create
    # byebug
    note = Note.create(note_params)

DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 8]]
---
  def destroy
    noteId = @note.id
    @note.destroy

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def set_note
    @note = Note.find(params[:id])